
--<<graphic v0.2 doc>>--
-- 2010-01-03 by 白枫
--[低级接口,用于被其他函数封装]--

-------------------------------
-- 在屏幕上画一张图片,每帧调用才有效果
-- image	图像引用,调用LoadImage()函数获得
-- dx		图像坐标x
-- dy		图像坐标y
-- ImageToScene(image,dx,dy)
-------------------------------

-------------------------------
-- 在屏幕上画一张图片,每帧调用才有效果
-- image	图像引用,调用LoadImage()函数获得
-- dx		图像坐标x
-- dy		图像坐标y
-- alpha	图像透明度0-255
-- DrawImage(image,dx,dy,alpha)
-------------------------------

-------------------------------
-- 读取一个图像文件,并返回一个图像引用
-- file		文件路径名
-- mode		读取模式,有565,5551,4444和8888四种模式,数字越大效果越好
-- LoadImage(file,mode)
-------------------------------

-------------------------------
-- 创建一个颜色遮罩
-- red		红色分量
-- green	绿色分量
-- blue		蓝色分量
-- alpha	透明值
-- CreateMask(red,green,blue,alpha)
-------------------------------



--------------------------
-----以下为函数声明区-----
--------------------------

--------------------------------------------------
MASK_8888 = CreateMask(255,255,255,255,8888);
MASK_4444 = CreateMask(255,255,255,255,4444);
MASK_5551 = CreateMask(255,255,255,255,5551);
MASK_565 = CreateMask(255,255,255,255,565);

--------------------------------------------------


-----------------------------------------------
Print("graphic.lua Init success.\n");