--<<setting v0.2 doc>>--
-- 2010-02-25 by 白枫
--[设置相关接口]--

----------------------------------------------

-- 设置游戏流程
-- module	流程,QUIT_MODULE,EVENT_MODULE,SELECT_MODULE
-- SetGameMode(module)
-----------------------------

-- 取得游戏流程
-- 返回值:游戏流程
-- GetGameMode()
-----------------------------

-- 设置屏幕默认颜色
-- r,g,b,a	红-绿-蓝-透明值-的分量(0-255)
-- SetSceneColor(r,g,b,a)
-----------------------------

-- 设置cpu频率
-- mhz		333,222,111
-- setcpumhz(mhz)
-----------------------------

-- 获得当前cpu频率
-- 无
-- getcpumhz()
-----------------------------

-- 获得机器网卡id,返回字串
-- 无
-- getmac()
-----------------------------

-- 获得机器用户名字,返回字串
-- 无
-- getnickname()
-----------------------------

-----------------------------------------------
Print("setting.lua Init success.\n");